N = int(input())
DP = [x for x in range(N+1)] # 모든 수는 1의 합으로 표현이 가능하므로 각 숫자에 해당하는 최대 개수로 초기화
for i in range(1,N+1) :
    for j in range(1,i) :
        if j*j > i : #최악의 경우 i의 제곱근 만큼 반복
            break
        if DP[i] > DP[i-j*j]+1:
            DP[i] = DP[i-j*j]+1
        #print(i,j)
        #print(DP)
print(DP[N])
'''
O(N) + O(N \sqrt N) = O(N \sqrt N)
'''
'''
>> 7

2 1
[0, 1, 2, 3, 4, 5, 6, 7]
3 1
[0, 1, 2, 3, 4, 5, 6, 7]
4 1
[0, 1, 2, 3, 4, 5, 6, 7]
4 2
[0, 1, 2, 3, 1, 5, 6, 7]
5 1
[0, 1, 2, 3, 1, 2, 6, 7]
5 2
[0, 1, 2, 3, 1, 2, 6, 7]
6 1
[0, 1, 2, 3, 1, 2, 3, 7]
6 2
[0, 1, 2, 3, 1, 2, 3, 7]
7 1
[0, 1, 2, 3, 1, 2, 3, 4]
7 2
[0, 1, 2, 3, 1, 2, 3, 4]
4
'''